Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.simulator.ui.usage
source: Usage: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] Options: appearance, liquid-glass, color-filter, text-size, reduce-motion, increase-contrast, show-borders, reduce-transparency, voiceover.
ar: الاستخدام: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] الخيارات: appearance، ‏liquid-glass، ‏color-filter، ‏text-size، ‏reduce-motion، ‏increase-contrast، ‏show-borders، ‏reduce-transparency، ‏voiceover.
de: Verwendung: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] Optionen: appearance, liquid-glass, color-filter, text-size, reduce-motion, increase-contrast, show-borders, reduce-transparency, voiceover.
es: Uso: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] Opciones: appearance, liquid-glass, color-filter, text-size, reduce-motion, increase-contrast, show-borders, reduce-transparency, voiceover.
fr: Utilisation : cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] Options : appearance, liquid-glass, color-filter, text-size, reduce-motion, increase-contrast, show-borders, reduce-transparency, voiceover.
ja: 使用方法: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] 項目: appearance、liquid-glass、color-filter、text-size、reduce-motion、increase-contrast、show-borders、reduce-transparency、voiceover。
ko: 사용법: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] 옵션: appearance, liquid-glass, color-filter, text-size, reduce-motion, increase-contrast, show-borders, reduce-transparency, voiceover.
zh_hans: 用法: cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] 选项：appearance、liquid-glass、color-filter、text-size、reduce-motion、increase-contrast、show-borders、reduce-transparency、voiceover。
zh_hant: 用法： cmux simulator ui [status] [--surface <id|ref|index>] cmux simulator ui [get] <option> [--surface <id|ref|index>] cmux simulator ui [set] <option> <value> [--surface <id|ref|index>] 選項：appearance, liquid-glass, color-filter, text-size, reduce-motion, increase-contrast, show-borders, reduce-transparency, voiceover。

# cli.simulator.usage
source: Usage: cmux simulator <subcommand> [args] [--surface <id|ref|index>] Subcommands: type [text] [--stdin|--file <path>] Type text and wait for transmission completion tap <x> <y> [x2 y2] Send a correlated one- or two-finger tap gesture <json> [--stdin|--file] Send 1...256 ordered normalized touch events multitouch <json> [--stdin|--file] Send ordered two-finger touch events swipe <x1> <y1> <x2> <y2> [steps] Send a sampled swipe button <name> Press a Simulator hardware button rotate <orientation> Rotate to a logical orientation ca <diagnostic> <on|off> Toggle a Core Animation diagnostic memory-warning Simulate a memory warning event-log [limit] Print recent Simulator events tools <show|hide|toggle> Control the Simulator tools inspector camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets Refresh and print Web Inspector targets attach <target-id> Attach the native Web Inspector session send [json] [--stdin|--file <path>] Send a raw JSON inspector command highlight <on|off> Highlight the attached page release Release the attached page Each command waits for its correlated Simulator-worker result. `send` prints the raw response carrying the same JSON request id.
ar: الاستخدام: cmux simulator <subcommand> [args] [--surface <id|ref|index>] الأوامر الفرعية: type [text] [--stdin|--file <path>] كتابة النص والانتظار حتى اكتمال الإرسال tap <x> <y> [x2 y2] إرسال نقرة منسقة بإصبع واحد أو إصبعين gesture <json> [--stdin|--file] إرسال من 1 إلى 256 حدث لمس طبيعي مرتب multitouch <json> [--stdin|--file] إرسال أحداث لمس مرتبة بإصبعين swipe <x1> <y1> <x2> <y2> [steps] إرسال تمريرة سريعة مأخوذة العينات button <name> الضغط على زر من أزرار جهاز Simulator rotate <orientation> تدوير إلى اتجاه منطقي ca <diagnostic> <on|off> تبديل تشخيص لـ Core Animation memory-warning محاكاة تحذير الذاكرة event-log [limit] طباعة أحداث Simulator الأخيرة tools <show|hide|toggle> التحكم في فاحص أدوات Simulator camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets تحديث وطباعة أهداف Web Inspector attach <target-id> إرفاق جلسة Web Inspector الأصلية send [json] [--stdin|--file <path>] إرسال أمر فاحص JSON خام highlight <on|off> تمييز الصفحة المرفقة release تحرير الصفحة المرفقة ينتظر كل أمر نتيجة عامل Simulator المترابطة الخاصة به. يطبع الأمر `send` الاستجابة الخام التي تحمل نفس معرف طلب JSON.
de: Verwendung: cmux simulator <subcommand> [args] [--surface <id|ref|index>] Unterbefehle: type [text] [--stdin|--file <path>] Text eingeben und auf den Abschluss der Übertragung warten tap <x> <y> [x2 y2] Einen korrelierten Ein- oder Zwei-Finger-Tipp senden gesture <json> [--stdin|--file] 1...256 geordnete normalisierte Touch-Ereignisse senden multitouch <json> [--stdin|--file] Geordnete Zwei-Finger-Touch-Ereignisse senden swipe <x1> <y1> <x2> <y2> [steps] Einen gesampelten Wisch senden button <name> Eine Simulator-Hardwaretaste drücken rotate <orientation> In eine logische Ausrichtung drehen ca <diagnostic> <on|off> Eine Core-Animation-Diagnose umschalten memory-warning Eine Speicherwarnung simulieren event-log [limit] Letzte Simulator-Ereignisse ausgeben tools <show|hide|toggle> Den Simulator-Tools-Inspector steuern camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets Web-Inspector-Ziele aktualisieren und ausgeben attach <target-id> Die native Web-Inspector-Sitzung anhängen send [json] [--stdin|--file <path>] Einen rohen JSON-Inspector-Befehl senden highlight <on|off> Die angehängte Seite hervorheben release Die angehängte Seite freigeben Jeder Befehl wartet auf sein korreliertes Simulator-Worker-Ergebnis. `send` gibt die rohe Antwort aus, die dieselbe JSON-Anforderungs-ID trägt.
es: Uso: cmux simulator <subcommand> [args] [--surface <id|ref|index>] Subcomandos: type [text] [--stdin|--file <path>] Escribe texto y espera a que se complete la transmisión tap <x> <y> [x2 y2] Envía un toque correlacionado de uno o dos dedos gesture <json> [--stdin|--file] Envía entre 1 y 256 eventos táctiles normalizados y ordenados multitouch <json> [--stdin|--file] Envía eventos táctiles ordenados de dos dedos swipe <x1> <y1> <x2> <y2> [steps] Envía un deslizamiento muestreado button <name> Presiona un botón de hardware del simulador rotate <orientation> Rota a una orientación lógica ca <diagnostic> <on|off> Alterna un diagnóstico de Core Animation memory-warning Simula una advertencia de memoria event-log [limit] Muestra eventos recientes del simulador tools <show|hide|toggle> Controla el inspector de herramientas del simulador camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets Actualiza y muestra los destinos de Web Inspector attach <target-id> Conecta la sesión nativa de Web Inspector send [json] [--stdin|--file <path>] Envía un comando de inspector JSON sin procesar highlight <on|off> Resalta la página conectada release Libera la página conectada Cada comando espera por su resultado correlacionado del worker del simulador. `send` muestra la respuesta sin procesar que lleva el mismo id de solicitud JSON.
fr: Utilisation : cmux simulator <subcommand> [args] [--surface <id|ref|index>] Sous-commandes : type [text] [--stdin|--file <path>] Saisir du texte et attendre la fin de la transmission tap <x> <y> [x2 y2] Envoyer un tap corrélé à un ou deux doigts gesture <json> [--stdin|--file] Envoyer 1...256 événements tactiles normalisés ordonnés multitouch <json> [--stdin|--file] Envoyer des événements tactiles à deux doigts ordonnés swipe <x1> <y1> <x2> <y2> [steps] Envoyer un glissement (swipe) échantillonné button <name> Appuyer sur un bouton matériel du simulateur rotate <orientation> Faire pivoter vers une orientation logique ca <diagnostic> <on|off> Basculer un diagnostic Core Animation memory-warning Simuler un avertissement de mémoire event-log [limit] Afficher les événements récents du simulateur tools <show|hide|toggle> Contrôler l'inspecteur d'outils du simulateur camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets Actualiser et afficher les cibles de l'inspecteur web attach <target-id> Attacher la session de l'inspecteur web natif send [json] [--stdin|--file <path>] Envoyer une commande d'inspecteur JSON brute highlight <on|off> Mettre en surbrillance la page attachée release Libérer la page attachée Chaque commande attend le résultat correspondant du worker du simulateur. `send` affiche la réponse brute portant le même identifiant de requête JSON.
ja: 使用方法: cmux simulator <subcommand> [args] [--surface <id|ref|index>] サブコマンド: type [text] [--stdin|--file <path>] テキストを入力して送信完了を待機 tap <x> <y> [x2 y2] 1本指または2本指のタップを送信 gesture <json> [--stdin|--file] 1〜256件の正規化タッチイベントを送信 multitouch <json> [--stdin|--file] 2本指タッチイベントを送信 swipe <x1> <y1> <x2> <y2> [steps] スワイプを送信 button <name> ハードウェアボタンを押す rotate <orientation> 指定した向きに回転 ca <diagnostic> <on|off> Core Animation診断を切り替え memory-warning メモリ警告を送信 event-log [limit] 最近のSimulatorイベントを表示 tools <show|hide|toggle> Simulatorツールインスペクタを操作 camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets Web Inspector対象を更新して表示 attach <target-id> Web Inspectorセッションを接続 send [json] [--stdin|--file <path>] 生のJSONコマンドを送信 highlight <on|off> 接続中のページを強調表示 release 接続中のページを解放 各コマンドは対応するSimulatorワーカーの結果を待機します。`send` は同じJSONリクエストIDの生の応答を表示します。
ko: 사용법: cmux simulator <subcommand> [args] [--surface <id|ref|index>] 하위 명령어: type [text] [--stdin|--file <path>] 텍스트를 입력하고 전송 완료를 대기 tap <x> <y> [x2 y2] 연관된 한 손가락 또는 두 손가락 탭 전송 gesture <json> [--stdin|--file] 1...256개의 정렬된 정규화된 터치 이벤트 전송 multitouch <json> [--stdin|--file] 정렬된 두 손가락 터치 이벤트 전송 swipe <x1> <y1> <x2> <y2> [steps] 샘플링된 스와이프 전송 button <name> 시뮬레이터 하드웨어 버튼 누르기 rotate <orientation> 논리적 방향으로 회전 ca <diagnostic> <on|off> Core Animation 진단 토글 memory-warning 메모리 부족 경고 시뮬레이션 event-log [limit] 최근 시뮬레이터 이벤트 출력 tools <show|hide|toggle> 시뮬레이터 도구 인스펙터 제어 camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets Web Inspector 대상을 새로 고치고 출력 attach <target-id> 네이티브 Web Inspector 세션 연결 send [json] [--stdin|--file <path>] 원시 JSON 인스펙터 명령어 전송 highlight <on|off> 연결된 페이지 하이라이트 release 연결된 페이지 해제 각 명령어는 연관된 시뮬레이터 워커 결과를 대기합니다. `send`는 동일한 JSON 요청 ID가 포함된 원시 응답을 출력합니다.
zh_hans: 用法：cmux simulator <subcommand> [args] [--surface <id|ref|index>] 子命令: type [text] [--stdin|--file <path>] 输入文本并等待传输完成 tap <x> <y> [x2 y2] 发送关联的单指或双指点按 gesture <json> [--stdin|--file] 发送 1...256 个有序的归一化触摸事件 multitouch <json> [--stdin|--file] 发送有序的双指触摸事件 swipe <x1> <y1> <x2> <y2> [steps] 发送一次采样滑动 button <name> 按下模拟器硬件按键 rotate <orientation> 旋转到某个逻辑方向 ca <diagnostic> <on|off> 切换某个 Core Animation 诊断项 memory-warning 模拟一次内存警告 event-log [limit] 输出最近的模拟器事件 tools <show|hide|toggle> 控制模拟器工具检查器 camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets 刷新并输出 Web Inspector 目标 attach <target-id> 附加原生 Web Inspector 会话 send [json] [--stdin|--file <path>] 发送原始 JSON 检查器命令 highlight <on|off> 高亮已附加的页面 release 释放已附加的页面 每条命令都会等待其关联的模拟器 worker 结果。`send` 会输出携带相同 JSON 请求 id 的原始响应。
zh_hant: 用法：cmux simulator <subcommand> [args] [--surface <id|ref|index>] 子命令： type [text] [--stdin|--file <path>] 輸入文字並等待傳輸完成 tap <x> <y> [x2 y2] 傳送相關聯的單指或雙指點按 gesture <json> [--stdin|--file] 傳送 1...256 個排序好的常態化觸控事件 multitouch <json> [--stdin|--file] 傳送排序好的雙指觸控事件 swipe <x1> <y1> <x2> <y2> [steps] 傳送抽樣的滑動 button <name> 按下模擬器硬體按鈕 rotate <orientation> 旋轉至邏輯方向 ca <diagnostic> <on|off> 切換 Core Animation 診斷項目 memory-warning 模擬記憶體警告 event-log [limit] 列印最近的模擬器事件 tools <show|hide|toggle> 控制模擬器工具檢測器 camera <configure|switch|mirror|status> ... permissions <list|grant|revoke|reset> ... ui [status|get|set] [option] [value] targets 重新整理並列印網頁檢測器目標 attach <target-id> 附加原生網頁檢測器工作階段 send [json] [--stdin|--file <path>] 傳送原始 JSON 檢測器命令 highlight <on|off> 醒目提示附加的頁面 release 釋放附加的頁面 每個命令都會等待其相關聯的模擬器工作程序結果。`send` 會列印帶有相同 JSON 請求識別碼的原始回應。

# cli.simulator.usage.inspection
source: Additional inspection commands: accessibility Print the bounded native accessibility tree foreground Print the foreground application
ar: أوامر الفحص الإضافية: accessibility طباعة شجرة إمكانية الوصول الأصلية المحدودة foreground طباعة التطبيق الذي في المقدمة
de: Zusätzliche Inspektionsbefehle: accessibility Den begrenzten nativen Bedienungshilfen-Baum ausgeben foreground Die Vordergrund-Anwendung ausgeben
es: Comandos de inspección adicionales: accessibility Muestra el árbol de accesibilidad nativo acotado foreground Muestra la aplicación en primer plano
fr: Commandes d'inspection supplémentaires : accessibility Afficher l'arbre d'accessibilité natif délimité foreground Afficher l'application au premier plan
ja: 追加の検査コマンド: accessibility 上限付きのネイティブアクセシビリティツリーを表示 foreground フォアグラウンドAppを表示
ko: 추가 검사 명령어: accessibility 경계가 지정된 네이티브 접근성 트리 출력 foreground 포그라운드 애플리케이션 출력
zh_hans: 附加的检查命令: accessibility 输出有界的原生辅助功能树 foreground 输出前台应用
zh_hant: 其他檢測命令： accessibility 列印有界限的原生輔助使用樹狀圖 foreground 列印前景應用程式

# cli.socket.error.commandTimedOut
source: Command timed out
ar: انتهت مهلة الأمر
de: Befehl hat das Zeitlimit überschritten
es: Tiempo de espera del comando agotado
fr: Délai de la commande dépassé
ja: コマンドがタイムアウトしました
ko: 명령어 제한 시간이 만료되었습니다
zh_hans: 命令超时
zh_hant: 命令逾時

# cli.socket.error.conflictingEnvironment
source: Refusing to choose socket: CMUX_SOCKET_PATH and CMUX_SOCKET differ. Use CMUX_SOCKET_PATH or unset CMUX_SOCKET.
ar: رفض اختيار المقبس: CMUX_SOCKET_PATH وCMUX_SOCKET مختلفان. استخدم CMUX_SOCKET_PATH أو قم بإلغاء تعيين CMUX_SOCKET.
de: Auswahl des Sockets abgelehnt: CMUX_SOCKET_PATH und CMUX_SOCKET unterscheiden sich. Verwenden Sie CMUX_SOCKET_PATH oder heben Sie die Definition von CMUX_SOCKET auf.
es: Se rechazó la elección de socket: CMUX_SOCKET_PATH y CMUX_SOCKET difieren. Usa CMUX_SOCKET_PATH o desactiva CMUX_SOCKET.
fr: Refus de choisir le socket : CMUX_SOCKET_PATH et CMUX_SOCKET diffèrent. Utilisez CMUX_SOCKET_PATH ou désactivez CMUX_SOCKET.
ja: ソケットを選択できません。CMUX_SOCKET_PATH と CMUX_SOCKET が異なります。CMUX_SOCKET_PATH を使うか、CMUX_SOCKET を解除してください。
ko: 소켓 선택 거부: CMUX_SOCKET_PATH와 CMUX_SOCKET이 다릅니다. CMUX_SOCKET_PATH를 사용하거나 CMUX_SOCKET 설정을 해제하세요.
zh_hans: 拒绝选择套接字：CMUX_SOCKET_PATH 与 CMUX_SOCKET 不一致。请使用 CMUX_SOCKET_PATH，或取消设置 CMUX_SOCKET。
zh_hant: 拒絕選擇 Socket：CMUX_SOCKET_PATH 與 CMUX_SOCKET 不同。請使用 CMUX_SOCKET_PATH 或取消設定 CMUX_SOCKET。

# cli.socket.error.discoveryFailed
source: No live cmux socket found. Tried:
ar: لم يتم العثور على مقبس cmux نشط. تم تجريب:
de: Kein aktiver cmux-Socket gefunden. Versucht:
es: No se encontró ningún socket de cmux activo. Se intentó:
fr: Aucun socket cmux actif trouvé. Tentatives effectuées :
ja: 稼働中の cmux ソケットが見つかりません。試行したパス:
ko: 활성 cmux 소켓을 찾을 수 없습니다. 시도한 경로:
zh_hans: 未找到可用的 cmux socket。已尝试:
zh_hant: 找不到任何作用中的 cmux Socket。已嘗試：

# cli.socket.error.failedToWrite
source: Failed to write to socket
ar: فشلت الكتابة إلى المقبس
de: Schreiben auf den Socket fehlgeschlagen
es: Error al escribir en el socket
fr: Échec de l'écriture sur le socket
ja: ソケットへの書き込みに失敗しました
ko: 소켓 쓰기에 실패했습니다
zh_hans: 写入套接字失败
zh_hant: 無法寫入至 Socket

# cli.socket.error.invalidUTF8Response
source: Invalid UTF-8 response
ar: استجابة UTF-8 غير صالحة
de: Ungültige UTF-8-Antwort
es: Respuesta UTF-8 no válida
fr: Réponse UTF-8 invalide
ja: UTF-8 形式ではない応答です
ko: 유효하지 않은 UTF-8 응답
zh_hans: 无效的 UTF-8 响应
zh_hant: 無效的 UTF-8 回應

# cli.socket.error.notConnected
source: Not connected
ar: غير متصل
de: Nicht verbunden
es: No conectado
fr: Non connecté
ja: 接続されていません
ko: 연결되지 않음
zh_hans: 未连接
zh_hant: 未連接

# cli.socket.error.responseExceededBatchLimit
source: Socket response exceeded batch limit
ar: تجاوزت استجابة المقبس حد الدفعة
de: Socket-Antwort hat das Batch-Limit überschritten
es: La respuesta del socket excedió el límite de lotes
fr: La réponse du socket a dépassé la limite du lot (batch)
ja: ソケット応答がバッチ上限を超えました
ko: 소켓 응답이 배치 제한을 초과했습니다
zh_hans: 套接字响应超出批处理上限
zh_hant: Socket 回應超出批次限制

# cli.socket.error.socketClosedBeforeCompleteReply
source: Socket closed before complete reply
ar: تم إغلاق المقبس قبل اكتمال الرد
de: Socket vor vollständiger Antwort geschlossen
es: El socket se cerró antes de completar la respuesta
fr: Socket fermé avant la réponse complète
ja: 完全な応答を受信する前にソケットが閉じられました
ko: 전체 회신이 완료되기 전에 소켓이 닫혔습니다
zh_hans: 套接字在完整回复前已关闭
zh_hant: Socket 在回覆完成前已關閉

# cli.socket.error.socketRead
source: Socket read error
ar: خطأ في قراءة المقبس
de: Socket-Lesefehler
es: Error de lectura del socket
fr: Erreur de lecture du socket
ja: ソケット読み取りエラー
ko: 소켓 읽기 오류
zh_hans: 套接字读取错误
zh_hant: Socket 讀取錯誤

# cli.socket.error.unexpectedExtraBatchResponse
source: Unexpected extra batched socket response
ar: استجابة مقبس دفعية إضافية غير متوقعة
de: Unerwartete zusätzliche per Batch übertragene Socket-Antwort
es: Respuesta de socket por lotes adicional inesperada
fr: Réponse de socket par lot supplémentaire inattendue
ja: 予期しない余分なバッチソケット応答を受信しました
ko: 예기치 않은 추가 배치 소켓 응답
zh_hans: 意外的多余批量套接字响应
zh_hant: 未預期的額外批次 Socket 回應

# cli.socket.error.workspaceNotClosed
source: Workspace not closed
ar: مساحة العمل لم تُغلق
de: Arbeitsbereich nicht geschlossen
es: El espacio de trabajo no se cerró
fr: Espace de travail non fermé
ja: ワークスペースを閉じられませんでした
ko: 작업 공간이 닫히지 않았습니다
zh_hans: 工作区未关闭
zh_hant: 工作區未關閉

# cli.socket.notice.rerouted
source: cmux: default socket %@ is unavailable; using %@.
ar: cmux: المقبس الافتراضي %@ غير متاح؛ سيتم استخدام %@.
de: cmux: Standard-Socket %@ ist nicht verfügbar; %@ wird verwendet.
es: cmux: el socket predeterminado %@ no está disponible; se usará %@.
fr: cmux : le socket par défaut %@ n'est pas disponible ; utilisation de %@.
ja: cmux: デフォルトソケット %@ は利用できないため、%@ を使用します。
ko: cmux: 기본 소켓 %@을(를) 사용할 수 없어 대신 %@을(를) 사용합니다.
zh_hans: cmux: 默认 socket %@ 不可用；改用 %@。
zh_hant: cmux：預設 Socket %@ 無法使用；改用 %@。

# cli.ssh.error.mixedTTYOptionCluster
source: ssh: mixed short-option cluster '%@' is not supported after the destination; use --ssh-option for SSH flags or -- for remote command arguments
ar: ssh: مجموعة خيارات قصيرة مختلطة '%@' غير مدعومة بعد الوجهة؛ استخدم --ssh-option لخيارات SSH أو -- لوسائط الأمر البعيد
bs: ssh: miješani klaster kratkih opcija '%@' nije podržan nakon odredišta; koristite --ssh-option za SSH zastavice ili -- za argumente udaljene naredbe
da: ssh: blandet kort indstillingsklynge '%@' understøttes ikke efter destinationen; brug --ssh-option til SSH-flag eller -- til argumenter til fjernkommandoen
de: ssh: Gemischter Kurzoptions-Cluster „%@“ wird nach dem Ziel nicht unterstützt; verwenden Sie --ssh-option für SSH-Optionen oder -- für Argumente des Remote-Befehls
es: ssh: el grupo de opciones cortas mixtas '%@' no se admite después del destino; usa --ssh-option para las opciones de SSH o -- para los argumentos del comando remoto
fr: ssh : le groupe d’options courtes mixtes « %@ » n’est pas pris en charge après la destination ; utilisez --ssh-option pour les options SSH ou -- pour les arguments de commande distante
it: ssh: il gruppo di opzioni brevi miste "%@" non è supportato dopo la destinazione; usa --ssh-option per le opzioni SSH o -- per gli argomenti del comando remoto
ja: ssh: 宛先の後の混在した短いオプションクラスター「%@」はサポートされていません。SSH フラグには --ssh-option、リモートコマンド引数には -- を使用してください
ko: ssh: 대상 뒤의 혼합 짧은 옵션 클러스터 '%@'는 지원되지 않습니다. SSH 플래그에는 --ssh-option을, 원격 명령 인수에는 --를 사용하세요
nb: ssh: blandet kortalternativklynge '%@' støttes ikke etter målet; bruk --ssh-option for SSH-flagg eller -- for argumenter til fjernkommandoen
pl: ssh: mieszany klaster krótkich opcji „%@” nie jest obsługiwany po miejscu docelowym; użyj --ssh-option dla flag SSH lub -- dla argumentów zdalnego polecenia
pt_br: ssh: o agrupamento misto de opções curtas "%@" não é compatível após o destino; use --ssh-option para opções SSH ou -- para argumentos do comando remoto
ru: ssh: смешанная группа коротких параметров «%@» после адресата не поддерживается; используйте --ssh-option для параметров SSH или -- для аргументов удалённой команды
th: ssh: ไม่รองรับกลุ่มตัวเลือกแบบสั้นที่ผสมกัน '%@' หลังปลายทาง โปรดใช้ --ssh-option สำหรับแฟล็ก SSH หรือ -- สำหรับอาร์กิวเมนต์คำสั่งระยะไกล
tr: ssh: hedefin ardından gelen karma kısa seçenek kümesi '%@' desteklenmiyor; SSH seçenekleri için --ssh-option, uzak komut bağımsız değişkenleri için -- kullanın
uk: ssh: змішаний кластер коротких параметрів «%@» після призначення не підтримується; використовуйте --ssh-option для параметрів SSH або -- для аргументів віддаленої команди
zh_hans: ssh：目标之后不支持混合短选项集“%@”；SSH 选项请使用 --ssh-option，远程命令参数请使用 --
zh_hant: ssh：目的地後不支援混合短選項叢集「%@」；SSH 選項請使用 --ssh-option，遠端命令引數請使用 --

# cli.ssh.autoReconnect.status
source: [cmux] ssh exited with status %s; reconnecting (attempt %s/%s).
ar: [cmux] انتهى ssh بالحالة %s؛ جارٍ إعادة الاتصال (المحاولة %s/%s).
bs: [cmux] ssh je završio sa statusom %s; ponovno povezivanje (pokušaj %s/%s).
da: [cmux] ssh afsluttede med status %s; genopretter forbindelse (forsøg %s/%s).
de: [cmux] ssh wurde mit Status %s beendet; erneuter Verbindungsaufbau (Versuch %s/%s).
es: [cmux] ssh terminó con el estado %s; reconectando (intento %s/%s).
fr: [cmux] ssh s’est arrêté avec l’état %s ; reconnexion (tentative %s/%s).
it: [cmux] ssh è terminato con stato %s; riconnessione in corso (tentativo %s/%s).
ja: [cmux] ssh はステータス %s で終了しました。再接続しています（試行 %s/%s）。
ko: [cmux] ssh가 상태 %s로 종료되었습니다. 다시 연결 중입니다(시도 %s/%s).
nb: [cmux] ssh avsluttet med status %s; kobler til på nytt (forsøk %s/%s).
pl: [cmux] ssh zakończył działanie ze statusem %s; ponowne łączenie (próba %s/%s).
pt_br: [cmux] ssh saiu com status %s; reconectando (tentativa %s/%s).
ru: [cmux] ssh завершился со статусом %s; переподключение (попытка %s/%s).
th: [cmux] ssh ออกจากการทำงานด้วยสถานะ %s; กำลังเชื่อมต่อใหม่ (ครั้งที่ %s/%s)
tr: [cmux] ssh %s durumuyla çıktı; yeniden bağlanıyor (deneme %s/%s).
uk: [cmux] ssh завершився зі статусом %s; повторне підключення (спроба %s/%s).
zh_hans: [cmux] ssh 已退出，状态为 %s；正在重新连接（第 %s/%s 次）。
zh_hant: [cmux] ssh 已結束，狀態為 %s；正在重新連線（第 %s/%s 次）。

# cli.ssh.autoReconnect.inputDiscard
source: [cmux] input typed while disconnected is discarded.
ar: [cmux] تم تجاهل الإدخال الذي تمت كتابته أثناء انقطاع الاتصال.
de: [cmux] Während der Trennung getätigte Eingaben werden verworfen.
es: [cmux] la entrada escrita mientras se estaba desconectado se descarta.
fr: [cmux] la saisie effectuée pendant la déconnexion est rejetée.
ja: [cmux] 切断中に入力した内容は破棄されます。
ko: [cmux] 연결이 끊어진 동안 입력된 내용은 무시됩니다.
zh_hans: [cmux] 断开期间输入的内容将被丢弃。
zh_hant: [cmux] 連線中斷時輸入的內容已被捨棄。
